# LAB 20_SQL SELECT

## Challenge 1 - Who Have Published What At Where?

In this challenge you will write a SELECT query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

- AUTHOR_ID - the ID of the author
- LAST_NAME - author last name
- FIRST_NAME - author first name
- TITLE - name of the published title
- PUBLISHER - name of the publisher where the title was published

If your query is correct, the total rows in your output should be the same as the total number of records in Table titleauthor.

In [1]:
# Import pandas and load iptyhon

import pandas as pd
%load_ext sql

In [2]:
# Define the queries and the connection with the Database

query = '''
SELECT a.au_id as AUTHOR_ID, a.au_lname as LAST_NAME, a.au_fname as FIRST_NAME, t.title as TITLE, p.pub_name as PUBLISHER
FROM authors a INNER JOIN titleauthor ta on a.au_id = ta.au_id INNER JOIN titles t on ta.title_id = t.title_id
INNER JOIN publishers p on t.pub_id = p.pub_id
'''
queryb = '''
SELECT *
FROM titleauthor
'''
db_url = 'sqlite:///publications.db'

In [3]:
# Call the query from the data base with pandas

df = pd.read_sql(query, db_url)
df

,AUTHOR_ID,LAST_NAME,FIRST_NAME,TITLE,PUBLISHER
0,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
1,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
2,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
3,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
5,267-41-2394,O'Leary,Michael,"Sushi, Anyone?",Binnet & Hardley
6,274-80-9391,Straight,Dean,Straight Talk About Computers,Algodata Infosystems
7,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
8,427-17-2319,Dull,Ann,Secrets of Silicon Valley,Algodata Infosystems
9,472-27-2349,Gringlesby,Burt,"Sushi, Anyone?",Binnet & Hardley
10,486-29-1786,Locksley,Charlene,Net Etiquette,Algodata Infosystems
11,486-29-1786,Locksley,Charlene,Emotional Security: A New Algorithm,New Moon Books
12,648-92-1872,Blotchet-Halls,Reginald,Fifty Years in Buckingham Palace Kitchens,Binnet & Hardley
13,672-71-3249,Yokomoto,Akiko,"Sushi, Anyone?",Binnet & Hardley
14,712-45-1867,del Castillo,Innes,Silicon Valley Gastronomic Treats,Binnet & Hardley
15,722-51-5454,DeFrance,Michel,The Gourmet Microwave,Binnet & Hardley
16,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
17,724-80-9391,MacFeather,Stearns,Computer Phobic AND Non-Phobic Individuals: Be...,Binnet & Hardley
18,756-30-7391,Karsen,Livia,Computer Phobic AND Non-Phobic Individuals: Be...,Binnet & Hardley
19,807-91-6654,Panteley,Sylvia,"Onions, Leeks, and Garlic: Cooking Secrets of ...",Binnet & Hardley
20,846-92-7186,Hunter,Sheryl,Secrets of Silicon Valley,Algodata Infosystems
21,899-46-2035,Ringer,Anne,The Gourmet Microwave,Binnet & Hardley
22,899-46-2035,Ringer,Anne,Is Anger the Enemy?,New Moon Books
23,998-72-3567,Ringer,Albert,Is Anger the Enemy?,New Moon Books
24,998-72-3567,Ringer,Albert,Life Without Fear,New Moon Books

In [4]:
# Check if the total rows in the output is the same as the total number of records in Table titleauthor

len(pd.read_sql(query, db_url)) == len(pd.read_sql(queryb, db_url))

True

## Challenge 2 - Who Have Published How Many At Where?

Elevating from your solution in Challenge 1, query how many titles each author has published at each publisher.

To check if your output is correct, sum up the TITLE COUNT column. The sum number should be the same as the total number of records in Table titleauthor.

In [5]:
# Define the queries and the connection with the Database

query2 = '''
SELECT a.au_id as AUTHOR_ID, a.au_lname as LAST_NAME, a.au_fname as FIRST_NAME, p.pub_name as PUBLISHER, count(t.title) as TITLE
FROM authors a INNER JOIN titleauthor ta on a.au_id = ta.au_id INNER JOIN titles t on ta.title_id = t.title_id
INNER JOIN publishers p on t.pub_id = p.pub_id
GROUP BY a.au_lname,a.au_fname,p.pub_name
'''
query2b = '''
SELECT *
FROM titleauthor
'''

In [6]:
# Call the query from the data base with pandas

df2 = pd.read_sql(query2, db_url)
df2

      AUTHOR_ID       LAST_NAME FIRST_NAME             PUBLISHER  TITLE
0   409-56-7008          Bennet    Abraham  Algodata Infosystems      1
1   648-92-1872  Blotchet-Halls   Reginald      Binnet & Hardley      1
2   238-95-7766          Carson     Cheryl  Algodata Infosystems      1
3   722-51-5454        DeFrance     Michel      Binnet & Hardley      1
4   427-17-2319            Dull        Ann  Algodata Infosystems      1
5   213-46-8915           Green   Marjorie  Algodata Infosystems      1
6   213-46-8915           Green   Marjorie        New Moon Books      1
7   472-27-2349      Gringlesby       Burt      Binnet & Hardley      1
8   846-92-7186          Hunter     Sheryl  Algodata Infosystems      1
9   756-30-7391          Karsen      Livia      Binnet & Hardley      1
10  486-29-1786        Locksley   Charlene  Algodata Infosystems      1
11  486-29-1786        Locksley   Charlene        New Moon Books      1
12  724-80-9391      MacFeather    Stearns  Algodata Infosystems      1
13  724-80-9391      MacFeather    Stearns      Binnet & Hardley      1
14  267-41-2394         O'Leary    Michael  Algodata Infosystems      1
15  267-41-2394         O'Leary    Michael      Binnet & Hardley      1
16  807-91-6654        Panteley     Sylvia      Binnet & Hardley      1
17  998-72-3567          Ringer     Albert        New Moon Books      2
18  899-46-2035          Ringer       Anne      Binnet & Hardley      1
19  899-46-2035          Ringer       Anne        New Moon Books      1
20  274-80-9391        Straight       Dean  Algodata Infosystems      1
21  172-32-1176           White    Johnson        New Moon Books      1
22  672-71-3249        Yokomoto      Akiko      Binnet & Hardley      1
23  712-45-1867    del Castillo      Innes      Binnet & Hardley      1

In [7]:
# Check if the total rows in the output is the same as the total number of records in Table titleauthor

pd.read_sql(query2, db_url)['TITLE'].sum() == len(pd.read_sql(query2b, db_url))

True

## Challenge 3 - Best Selling Authors

Who are the top 3 authors who have sold the highest number of titles? Write a query to find out.

Requirements:

Your output should have the following columns:
- AUTHOR_ID - the ID of the author
- LAST_NAME - author last name
- FIRST_NAME - author first name
- TOTAL - total number of titles sold from this author

Your output should be ordered based on TOTAL from high to low.

Only output the top 3 best selling authors.

In [8]:
# Define the queries and the connection with the Database

query3 = '''
SELECT a.au_id as AUTHOR_ID, a.au_lname as LAST_NAME, a.au_fname as FIRST_NAME, sum(s.qty) as TOTAL
FROM sales s INNER JOIN titles t on t.title_id = s.title_id INNER JOIN titleauthor ta on t.title_id = ta.title_id
INNER JOIN authors a on a.au_id = ta.au_id
GROUP BY a.au_id, a.au_lname, a.au_fname
ORDER BY TOTAL desc
LIMIT 3
'''

In [9]:
# Call the query from the data base with pandas

df3 = pd.read_sql(query3, db_url)
df3

     AUTHOR_ID LAST_NAME FIRST_NAME  TOTAL
0  899-46-2035    Ringer       Anne    148
1  998-72-3567    Ringer     Albert    133
2  213-46-8915     Green   Marjorie     50

## Challenge 4 - Best Selling Authors Ranking

Now modify your solution in Challenge 3 so that the output will display all 23 authors instead of the top 3. Note that the authors who have sold 0 titles should also appear in your output (ideally display 0 instead of NULL as the TOTAL). Also order your results based on TOTAL from high to low.

In [10]:
# Define the queries and the connection with the Database

query4 = '''
SELECT a.au_id as AUTHOR_ID, a.au_lname as LAST_NAME, a.au_fname as FIRST_NAME, sum(s.qty) as TOTAL
FROM sales s INNER JOIN titles t on t.title_id = s.title_id INNER JOIN titleauthor ta on t.title_id = ta.title_id
INNER JOIN authors a on a.au_id = ta.au_id
GROUP BY a.au_id, a.au_lname, a.au_fname
ORDER BY TOTAL desc
LIMIT 23
'''

In [11]:
# Call the query from the data base with pandas

df4 = pd.read_sql(query4, db_url)
df4

      AUTHOR_ID       LAST_NAME FIRST_NAME  TOTAL
0   899-46-2035          Ringer       Anne    148
1   998-72-3567          Ringer     Albert    133
2   213-46-8915           Green   Marjorie     50
3   427-17-2319            Dull        Ann     50
4   846-92-7186          Hunter     Sheryl     50
5   267-41-2394         O'Leary    Michael     45
6   724-80-9391      MacFeather    Stearns     45
7   722-51-5454        DeFrance     Michel     40
8   807-91-6654        Panteley     Sylvia     40
9   238-95-7766          Carson     Cheryl     30
10  486-29-1786        Locksley   Charlene     25
11  472-27-2349      Gringlesby       Burt     20
12  648-92-1872  Blotchet-Halls   Reginald     20
13  672-71-3249        Yokomoto      Akiko     20
14  756-30-7391          Karsen      Livia     20
15  172-32-1176           White    Johnson     15
16  274-80-9391        Straight       Dean     15
17  409-56-7008          Bennet    Abraham     15
18  712-45-1867    del Castillo      Innes     10

## Bonus Challenge - Most Profiting Authors

Authors earn money from their book sales in two ways: advance and royalties. An advance is the money that the publisher pays the author before the book comes out. The royalties the author will receive is typically a percentage of the entire book sales. The total profit an author receives by publishing a book is the sum of the advance and the royalties.

Given the information above, who are the 3 most profiting authors and how much royalties each of them have received? Write a query to find out.

Requirements:

Your output should have the following columns:
- AUTHOR_ID - the ID of the author
- LAST_NAME - author last name
- FIRST_NAME - author first name
- PROFIT - total profit the author has received combining the advance and royalties

Your output should be ordered from higher PROFIT values to lower values.

Only output the top 3 most profiting authors.

In [12]:
# Define the queries and the connection with the Database

query5 = '''
with profit_authors as
(SELECT a.au_id as AUTHOR_ID, a.au_lname as LAST_NAME, a.au_fname as FIRST_NAME, t.title as TITLE, t.advance * ta.royaltyper / 100
as TOTAL_ADV, sum(t.price * s.qty * ta.royaltyper / 100 * t.royalty / 100) as TOTAL_ROY
FROM sales s INNER JOIN titles t on t.title_id = s.title_id INNER JOIN titleauthor ta on t.title_id = ta.title_id
INNER JOIN authors a on a.au_id = ta.au_id
GROUP BY AUTHOR_ID, LAST_NAME,FIRST_NAME, TITLE, TOTAL_ADV
ORDER BY t.title)
SELECT AUTHOR_ID, LAST_NAME, FIRST_NAME, ROUND(SUM(TOTAL_ADV + TOTAL_ROY),1) as BENEFIT
FROM profit_authors
GROUP BY AUTHOR_ID
ORDER BY BENEFIT DESC
LIMIT 3
'''

In [13]:
# Call the query from the data base with pandas

df5 = pd.read_sql(query5, db_url)
df5

     AUTHOR_ID LAST_NAME FIRST_NAME  BENEFIT
0  213-46-8915     Green   Marjorie  12162.1
1  722-51-5454  DeFrance     Michel  11271.5
2  998-72-3567    Ringer     Albert   7225.0